# Создать образ на основе базового слоя,
# который содержит файлы ОС и интерпретатор Python 3.11.
FROM python:3.11

WORKDIR /app

# Скопировать с локального компьютера файл зависимостей
COPY requirements.txt .

RUN pip install -r requirements.txt

# Скопировать всё необходимое содержимое 
# той директории локального компьютера, где сохранён Dockerfile,
# в текущую рабочую директорию образа — /app.
COPY . .

# При старте контейнера запустить сервер разработки.
CMD ["pytest", "--alluredir", "allure-results"]